In [7]:
import os
import pandas as pd

current_directory = os.getcwd()
current_directory

'/home/nguyenbuitk/own-repos/python-script/example/pandas'

In [6]:

csv_file_path = os.path.join(current_directory, 'data.csv')
df_csv = pd.read_csv(csv_file_path)

df_csv

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Phoenix